#include <iostream>

int main()
{
    int N,N100,N10,N1;

    setlocale(LC_ALL, "Russian");
    std::cout << "Введите число от 100 до 999" << std::endl;
    std::cin >> N;

    N100 = N / 100;//находим значение сотен
    N10 = (N - N100*100 )/ 10;//находим значение десятков
    N1 = (N - N100*100)-(N10*10);//находим значение единиц

    if (N100 <= 5)//выводим значение сотен
    {
        if (N100==1)
        {std::cout << "Введенное число - сто ";}
        if (N100==2)
        {std::cout << "Введенное число - двести ";}
        if (N100==3)
        {std::cout << "Введенное число - триста ";}
        if (N100==4)
        {std::cout << "Введенное число - четыресто ";}
        if (N100==5)
        {std::cout << "Введенное число - пятьсот ";}
    }
    else 
    {
        if (N100==6)
        {std::cout << "Введенное число - шестьсот ";}
        if (N100==7)
        {std::cout << "Введенное число - семьсот ";}
        if (N100==8)
        {std::cout << "Введенное число - восемьсот ";}
        if (N100==9)
        {std::cout << "Введенное число - девятьсот ";}
    }

    
    if (N10 <= 5)//выводим значение десятков
    {
        if (N10==1)
        {
            if(N1==0)
            {std::cout << "десять ";}
            if(N1==1)
            {std::cout << "одиннадцать ";}
            if(N1==2)
            {std::cout << "двеннадцать ";}
            if(N1==3)
            {std::cout << "тринадцать ";}
            if(N1==4)
            {std::cout << "четырнадцать ";}
            if(N1==5)
            {std::cout << "пятнадцать ";}
            if(N1==6)
            {std::cout << "шестнадцать ";}
            if(N1==7)
            {std::cout << "семнадцать ";}
            if(N1==8)
            {std::cout << "восемнадцать ";}
            if(N1==9)
            {std::cout << "девятнадцать ";}
            
        }
        if (N10==2)
        {std::cout << "двадцать ";}
        if (N10==3)
        {std::cout << "тридцать ";}
        if (N10==4)
        {std::cout << "сорок ";}
        if (N10==5)
        {std::cout << "пятдесят ";}
    }
    else
    {
        if (N10==6)
        {std::cout << "шестдесть ";}
        if (N10==7)
        {std::cout << "семдесять ";}
        if (N10==8)
        {std::cout << "восемдесять ";}
        if (N10==9)
        {std::cout << "девяносто ";}
    }


    if ((N1 <= 5)&(N10!=1))//выводим значение единиц
    {
        if (N1==1)
        {std::cout << "один ";}
        if (N1==2)
        {std::cout << "два ";}
        if (N1==3)
        {std::cout << "три ";}
        if (N1==4)
        {std::cout << "четыре ";}
        if (N1==5)
        {std::cout << "пять ";}
    }
    else
    {
        if (N10 != 1)
        {
        if (N1==6)
        {std::cout << "шесть ";}
        if (N1==7)
        {std::cout << "семь ";}
        if (N1==8)
        {std::cout << "восемь ";}
        if (N1==9)
        {std::cout << "девять ";}
        }
    }

    return 0;
}